site/preview/2020-06-25-hello-world.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://esac-io.github.io/rss.xml"
      title="RSS feed for https://esac-io.github.io/"/>
<title>Hello World</title>
</head>
<body>
<div id="preamble" class="status">
</div>
<div id="content">
<div class="post-date">25 Jun 2020</div><h1 class="post-title"><a href="https://esac-io.github.io/2020-06-25-hello-world.html">Hello World</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc21548c">1. Introduction</a></li>
<li><a href="#orgbd654dc">2. The Setup</a></li>
<li><a href="#orge68ab03">3. The Files</a></li>
<li><a href="#org1feb241">4. The Apparence</a></li>
<li><a href="#org7889bee">5. The Features</a></li>
<li><a href="#org1cf4728">6. The Functions</a></li>
<li><a href="#org86b7a3a">7. The Conclusion</a></li>
<li><a href="#orgcb90aec">8. References</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgc21548c" class="outline-2">
<h2 id="orgc21548c"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is just a <code>hello world</code> type of blog post to explain and
test the capabilities of <code>org-static-blog</code>, I also want to
provide a template (as a reference for others and myself)
to address the process of writing new articles (or blog posts).
</p>

<p>
The blog post (or article) will be dived in six sections.
The first one called 'The Setup' will explains how to install the
software used and a little rationalization on why they were chosen.
</p>

<p>
After that, in 'The Files' section, we will dissect the static
<code>html/css</code> files used by <code>org-mode</code> export/publish features.
</p>

<p>
On 'The Apparence' will be discussed the design decisions on the
perspective of someone who doesn't know much about <code>CSS</code>
and hate (with vigor) the world wide web front-end
technologies.
</p>

<p>
In the 'The Features' sections, we will get more context
on what is offered by the Emacs's packages in question
(<code>org-mode</code> and <code>org-static-blog</code>) and what can be achieved
with them, providing examples for each encounter feature.
</p>

<p>
The created functions to make everything more practical and
dynamic are described on 'The Functions' section.
</p>

<p>
As expected, in the section 'The Conclusion' will be
summarized what was learned and a small discussion on
why is so important to strive for simplicity, optimization
and minimalism.
</p>

<p>
The links will be listed in the 'References' it is the final section.
</p>
</div>
</div>

<div id="outline-container-orgbd654dc" class="outline-2">
<h2 id="orgbd654dc"><span class="section-number-2">2</span> The Setup</h2>
</div>
<div id="outline-container-orge68ab03" class="outline-2">
<h2 id="orge68ab03"><span class="section-number-2">3</span> The Files</h2>
</div>
<div id="outline-container-org1feb241" class="outline-2">
<h2 id="org1feb241"><span class="section-number-2">4</span> The Apparence</h2>
</div>
<div id="outline-container-org7889bee" class="outline-2">
<h2 id="org7889bee"><span class="section-number-2">5</span> The Features</h2>
</div>
<div id="outline-container-org1cf4728" class="outline-2">
<h2 id="org1cf4728"><span class="section-number-2">6</span> The Functions</h2>
</div>
<div id="outline-container-org86b7a3a" class="outline-2">
<h2 id="org86b7a3a"><span class="section-number-2">7</span> The Conclusion</h2>
</div>
<div id="outline-container-orgcb90aec" class="outline-2">
<h2 id="orgcb90aec"><span class="section-number-2">8</span> References</h2>
</div>
<div class="taglist"><a href="https://esac-io.github.io/tags.html">Tags</a>: <a href="https://esac-io.github.io/tag-emacs.html">emacs</a> <a href="https://esac-io.github.io/tag-blog.html">blog</a> <a href="https://esac-io.github.io/tag-org-mode.html">org-mode</a> <a href="https://esac-io.github.io/tag-org-static-blog.html">org-static-blog</a> </div></div>
<div id="postamble" class="status"><div id="postamble" class="status">
<div class="site-footer">
  <center>
    Powered
    by <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a><br>
    org-mode version: 9.3
  </center>
</div>
</div>
</div>
</body>
</html>
